УправДом/src/Reports/ИсторияПлатежей/ИсторияПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ИсторияПлатежей</name>
</mdclass:Report>

УправДом/src/Catalogs/ВидыПлатежей/ВидыПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыПлатежей</name>
  <predefined>
    <items>
      <name>Газоснабжение</name>
      <description>Газоснабжение</description>
    </items>
    <items>
      <name>ДопУслугиИнтернет</name>
      <description>Допуслуги интернет</description>
    </items>
    <items>
      <name>Интернет</name>
      <description>Интернет</description>
    </items>
    <items>
      <name>ТКО</name>
      <description>ТКО</description>
    </items>
    <items>
      <name>Электроснабжение</name>
      <description>Электроснабжение</description>
    </items>
  </predefined>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Счетчик</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
</mdclass:Catalog>

УправДом/src/Reports/ИсторияПлатежей/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//	Очищаем настройки выбранных полей
	Для Каждого Элемент Из КомпоновщикНастроек.Настройки.Выбор.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ВыбранноеПолеКомпоновкиДанных") Then
			Элемент.Использование = Истина; // Сначала всем включаем видимость
		КонецЕсли;
	КонецЦикла;
	
	// Инициализируем переменную для хранения значения параметра
	ВидПлатежа = Неопределено;
	
	// Создаем объект для поиска по имени параметра
	ПараметрВидПлатежа = Новый ПараметрКомпоновкиДанных("ВидПлатежа");
	
	// Ищем параметр "ВидПлатежа" в коллекции параметров
	Для Каждого ЭлементПараметра Из КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных.Элементы Цикл
		Если ТипЗнч(ЭлементПараметра) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") 
			И ЭлементПараметра.Параметр = ПараметрВидПлатежа Тогда
			
			ВидПлатежа = ЭлементПараметра.Значение;
			Прервать; // Параметр найден, выходим из цикла
		КонецЕсли;
	КонецЦикла;
	
	// Если параметр не найден или не задан, ничего не делаем
	Если ВидПлатежа = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
   //	получаем поля для скрытия в зависимости от вида платежа
	ПоляДляСкрытия = ПолучитьМассивПолейДляСкрытия(ВидПлатежа);
		
	//  Отключение полей
	Для Каждого Элемент Из КомпоновщикНастроек.Настройки.Выбор.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ВыбранноеПолеКомпоновкиДанных") И
           ПоляДляСкрытия.Найти(Элемент.Поле) <> Неопределено Тогда
            Элемент.Использование = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьМассивПолейДляСкрытия(ВидПлатежа) Экспорт
	
	ПоляДляСкрытия = Новый Массив;

	Если ВидПлатежа = Справочники.ВидыПлатежей.Газоснабжение 
		Или ВидПлатежа = Справочники.ВидыПлатежей.Электроснабжение Тогда

		ПоляДляСкрытия.Добавить(Новый ПолеКомпоновкиДанных("ДопТариф"));
		ПоляДляСкрытия.Добавить(Новый ПолеКомпоновкиДанных("Норматив"));
		
	ИначеЕсли ВидПлатежа = Справочники.ВидыПлатежей.Интернет Тогда
		
		ПоляДляСкрытия.Добавить(Новый ПолеКомпоновкиДанных("ТекущиеПоказания"));
		ПоляДляСкрытия.Добавить(Новый ПолеКомпоновкиДанных("ПоказанияНачисления"));
		ПоляДляСкрытия.Добавить(Новый ПолеКомпоновкиДанных("СтарыеПоказания"));
		ПоляДляСкрытия.Добавить(Новый ПолеКомпоновкиДанных("Норматив"));
			
	ИначеЕсли ВидПлатежа = Справочники.ВидыПлатежей.ТКО Тогда
		
		ПоляДляСкрытия.Добавить(Новый ПолеКомпоновкиДанных("ТекущиеПоказания"));
		ПоляДляСкрытия.Добавить(Новый ПолеКомпоновкиДанных("ПоказанияНачисления"));
		ПоляДляСкрытия.Добавить(Новый ПолеКомпоновкиДанных("СтарыеПоказания"));
		ПоляДляСкрытия.Добавить(Новый ПолеКомпоновкиДанных("ДопТариф"));
				
	КонецЕсли;

	Возврат ПоляДляСкрытия;

КонецФункции


#КонецОбласти

#КонецЕсли
